Autodesk.Revit.DB.OBJExportOptions.SetTessellationSettings(Autodesk.Revit.DB.ExportResolution)
Sets all the tessellation parameters to its predefined values for the given resolution type.
resolutionType:
Type of exporting resolution.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.IsGridAspectRatioSet
Checks whether the GridAspectRatio tessellation parameter is explicitly set.
Returns:
True if GridAspectRatio tessellation parameter is explicitly set, false otherwise.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.IsValidForGridAspectRatio(System.Double)
Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter.
value:
The value to be checked.
Returns:
True if the value is valid for GridAspectRatio, false otherwise.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.IsMaxEdgeLengthSet
Checks whether the MaxEdgeLength tessellation parameter is explicitly set.
Returns:
True if MaxEdgeLength tessellation parameter is explicitly set, false otherwise.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.IsValidForMaxEdgeLength(System.Double)
Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter.
value:
The value to be checked.
Returns:
True if the value is valid for MaxEdgeLength, false otherwise.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.IsNormalToleranceSet
Checks whether the NormalTolerance tessellation parameter is explicitly set.
Returns:
True if NormalTolerance tessellation parameter is explicitly set, false otherwise.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.IsValidForNormalTolerance(System.Double)
Checks whether the value is allowed (is in the allowed range) for NormalTolerance tessellation parameter.
value:
The value to be checked.
Returns:
True if the value is valid for NormalTolerance, false otherwise.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.IsSurfaceToleranceSet
Checks whether the SurfaceTolerance tessellation parameter is explicitly set.
Returns:
True if SurfaceTolerance tessellation parameter is explicitly set, false otherwise.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.IsValidForSurfaceTolerance(System.Double)
Checks whether the value is allowed (is in the allowed range) for SurfaceTolerance tessellation parameter.
value:
The value to be checked.
Returns:
True if the value is valid for SurfaceTolerance, false otherwise.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.GridAspectRatio
The maximum aspect ratio allowed in the grid placed across the face.
The minimum allowed value is 1.0. The maximum allowed value is 10.0. By default this property is ignored.
Remarks:
This property can be set by using export resolution type (by creation of OBJExportOptions or using Autodesk::Revit::DB::OBJExportOptions::setTessellationSettings(ExportResolution::Enum) method).
In the case of Fine, Medium and Coarse resolutions, this property has the same value (10.0) and it is considered as explicitly set by the user.
In the case of Custom resolution type, this property is only allowed to be obtained if it has been explicitly set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value gridAspectRatio is outside the allowable range of values for GridAspectRatio tessellation parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
GridAspectRatio tessellation parameter is default (hasn't been explicitly set by the user) and cannot be obtained now.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.MaxEdgeLength
The maximum length allowed for any chord on an edge or between any two adjacent grid lines. This is a percentage value.
By exporting, the real value of maximum edge length is calculated as a percent from the length of the diameter of the body bounding box.
The minimum allowed value is 0.1%. The maximum allowed value is 10.0%. By default this property is ignored.
Remarks:
This property can be set by using export resolution type (by creation of OBJExportOptions or using Autodesk::Revit::DB::OBJExportOptions::setTessellationSettings(ExportResolution::Enum) method).
In the case of Fine, Medium and Coarse resolutions, this property has the same value (10.0%) and it is considered as explicitly set by the user.
In the case of Custom resolution type, this property is only allowed to be obtained if it has been explicitly set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value maxEdgeLength is outside the allowable range of values for MaxEdgeLength tessellation parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
MaxEdgeLength tessellation parameter is default (hasn't been explicitly set by the user) and cannot be obtained now.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.NormalTolerance
The maximum change in the surface normal between adjacent nodes in the mesh. This property is defined in degrees.
The minimum allowed value is 1.0 degrees. The maximum allowed value is 45.0 degrees. Default value is 15.0 degrees.
Remarks:
This property can be set by using export resolution type (by creation of OBJExportOptions or using Autodesk::Revit::DB::OBJExportOptions::setTessellationSettings(ExportResolution::Enum) method).
In the case of Fine (10.0 degrees), Medium (15.0 degrees) and Coarse (30.0 degrees) resolutions, this property is considered as explicitly set by the user.
In the case of Custom resolution type, this property is only allowed to be obtained if it has been explicitly set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value normalTolerance is outside the allowable range of values for NormalTolerance tessellation parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
NormalTolerance tessellation parameter is default (hasn't been explicitly set by the user) and cannot be obtained now.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.SurfaceTolerance
The maximum distance between mesh triangles and model geometry. This is a percentage value.
By exporting, the real value of surface tolerance is calculated as a percent from the length of the diameter of the body bounding box.
The minimum allowed value is 0.001%. The maximum allowed value is 1.0%. Default value is 0.1%.
Remarks:
This property can be set by using export resolution type (by creation of OBJExportOptions or using Autodesk::Revit::DB::OBJExportOptions::setTessellationSettings(ExportResolution::Enum) method).
In the case of Fine (0.005%), Medium (0.016%) and Coarse (0.04%) resolutions, this property is considered as explicitly set by the user.
In the case of Custom resolution type, this property is only allowed to be obtained if it has been explicitly set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value surfaceTolerance is outside the allowable range of values for SurfaceTolerance tessellation parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
SurfaceTolerance tessellation parameter is default (hasn't been explicitly set by the user) and cannot be obtained now.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.TargetUnit
The unit type of geometry in the resultant OBJ file.
Default value is ExportUnit::Default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.#ctor(Autodesk.Revit.DB.ExportResolution)
Constructs a new instance of OBJExportOptions with all predefined tessellation settings, depending on export resolution type.
Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
resolutionType:
The type of export resolution.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.OBJExportOptions.#ctor
Constructs a new instance of OBJExportOptions with default values of all properties.
Since:
2023

Autodesk.Revit.DB.OBJExportOptions
The export options used by exporting to OBJ file format.
Since:
2023